# 7장
# 1. 두 수의 합
# 덧셈하여 타겟을 만들 수 있는 배열의 두 숫자 인덱스를 리턴하라.
# A-1) 브루트 포스로 계산
# A-2) in을 이용한 탐색
# A-3) 첫 번째 수를 뺀 결과 키 조회
# A-4) 조회 구조 개선
# A-5) 투 포인터 이용
nums = [2, 7, 11, 15]
target = 18


# 2. 빗물 트레핑
# A-1) 투 포인터를 쵀대로 이동
# A-2) 스택 쌓기
height = [0, 1, 0, 2, 1, 0, 1, 3, 2, 1, 2, 1]


# 3. 세 수의 합
# A-1) 브루트 포스로 계산
# A-2) 투 포인터 합 계산
nums = [-1, 0, 1, 2, -1, -4]


# 4. 배열 파티션
# n개의 페어를 이용한 min(a, b)의 합으로 만들 수 있는 가장 큰 수를 출력하라
# A-1) 오름차순 풀이
# A-2) 짝수 번째 값 계산
# A-3) 파이썬다운 방식
nums = [1, 4, 2, 3]


# 5. 자신을 제외한 배열의 곱
# 왼쪽 곱셈 결과에 오른쪽 값을 차례대로 곱셈 (나눗셈 X)
nums = [1, 2, 3, 4]


# 6. 주식을 사고팔기 가장 좋은 시점
# 한 번의 거래로 낼 수 있는 최대 이익을 산출하라
# ex) 1일 때 사서 6일 때 팔면 5의 이익을 얻는다
# A-1) 브루트 포스로 계산
# A-2) 저점과 현재 값과이 차이 계산
prices = [7, 1, 5, 3, 6, 4]
